[
    "1. Which button makes alphabets/letters in uppercase and lowercase and numbers to symbols?",
    "2. When a computer is switched on, the booting process performs__?",
    "3. What is the software frequently utilized by end users called (like Word, PowerPoint)?",
    "4. Unit of measurement of the output quality of a printer?",
    "5. Switching device of fifth generation computer is__?",
    "6. The unit KIPS is used to measure the speed of __?",
    "7. DOS stands for__?",
    "8. What is a joy stick primarily in computers used for?",
    "9. In 1999, the Melissa virus was a widely publicised__?",
    "10. COBOL is an acronym for__?",
    "11. The ability of an OS to run more than one application at a time is called?",
    "12. What is the functional key to display save-as box?",
    "13. Full form of NOS ?",
    "14. Something which has easily understood instructions is said to be..........?",
    "15. A modem is connected to a__?",
    "16. Refresh Rate of monitor is measured in?",
    "17. What was the chief component of first generation computer?",
    "18. Who is the father of Computer science?",
    "19. In a computer, most processing takes place in__?",
    "20. In which type of computer, data are represented as discrete signals?",
    "21. A computer cannot 'boot' if it does not have the__?",
    "22. What is the other name for programmed chip?",
    "23. A normal CD- ROM usually can store up to _____data?",
    "24. What does DMA stand for?",
    "25. Full form of LAN ?",
    "26. ASCII stands for__?",
    "27. Scientific Name of Computer?",
    "28. What is the name of the display feature that highlights are of the screen which requires operator attention?",
    "29. Computers, combine both measuring and counting, are called__?",
    "30. Name the Father of Computer Mouse?",
    "31. A program that performs a useful task while simultaneously allowing destructive acts is __?",
    "32. The geometric arrangement of devices on the network is called...........?",
    "33. The basic goal of computer process is to convert data into ___?",
    "34. Where are the CPU and memory located?",
    "35. Who is known as the founder of IBM Company?",
    "36. An image on a computer screen is made up of__?",
    "37. Full form of MAN ?",
    "38. Which command in DOS can be used to recover accidentally deleted files?",
    "39. A computer program that converts an entire program into machine language at one time is called__?",
    "40. In which year, the Microsoft company was founded?",
    "41. What is the personal computer operating system that organizes and uses a graphic desktop environment?",
    "42. What are Light pen and joystick ?",
    "43. What is a half byte also called as?",
    "44. SMPS stands for__?",
    "45. What do we use to change the appearance and positioning of text document in MS Word?",
    "46. When did arch rivals IBM and Apple Computers Inc. decide to join hands?",
    "47. What kind of memory is both static and non -volatile?",
    "48. An error in software or hardware is called a bug. What is the alternative computer jargon for it?",
    "49. Unwanted repetitious messages, such as unsolicited bulk e-mail is known as__?",
    "50. The common name for the crime of stealing passwords is__?",
    "51. BIOS stands for __?",
    "52. Who is regarded as Father of “C‘ programming language?",
    "53. RAM can be treated as the ......... for the computer's processor. –Waiting Room\n54. Computers manipulate data in many ways, and this manipulation is called__?",
    "54. Computers manipulate data in many ways, and this manipulation is called__?",
    "55. Joshy, Perfumes are examples of __?",
    "56. The ability to recover and read deleted or damaged files from a criminal's computer is an example of a law enforcement speciality called__?",
    "57. Where does most data go first with in a computer memory hierarchy?",
    "58. Help Menu is available at which button?",
    "59. Which file contains permanent data and gets updated during the processing of transactions?",
    "60. A DVD is an example of an__?",
    "61. Which is most common tool used to restrict access to computer system?",
    "62. The technology that stores only essential instructions on a microprocessor chip and thus enhances its speed is referred as__?",
    "63. What is the name of an application program that gathers user information and sends it to someone through the Internet?",
    "64. A ________ is approximately a million bytes?",
    "65. Daisy wheel, Drum, chain etc are the__?",
    "66. XML stands for __?",
    "67. What is FORTRAN?",
    "68. What translates and executes program at run time line by line?",
    "69. What converts an entire program into machine language ?",
    "70. Who is the father of personal computer?",
    "71. EEPROM stands for__?",
    "72. Who developed the first electronic computer?",
    "73. Which programming languages are classified as low level languages?",
    "74. The first web browser is__?",
    "75. First page of Website is termed as__?",
    "76. IBM stands for__?",
    "77. Office LANS, which are scattered geographically on large scale, can be connected by the use of corporate__?",
    "78. To move a copy of file from one computer to another over a communication channel is called?",
    "79. Large transaction processing systems in automated organisations use__?",
    "80. MICR stands for__?",
    "81. Name of 1st electronic computer?",
    "82. No. of different characters in ASCII coding system?",
    "83. MSIC stands for _?",
    "84. The scrambling of code is known as__?",
    "85. The first computers were programmed using__?",
    "86. A fault in a computer program which prevents it from working correctly is known as__?",
    "87. What kind of scheme is the HTTP protocol?",
    "88. Magnetic disk is an example of__?",
    "89. What is the meaning of OSI, in terms of computers ?",
    "90. Which type of storage device is a BIOS ?",
    "91. What is the extension type of the excel 2007 files?",
    "92. Collecting personal information and effectively posing as another individual is known as the crime of__?",
    "93. The amount of vertical space between lines of text in a document is called__?",
    "94. Second Generation computers were developed during__?",
    "95. Which of the following commands is given to reboot the computer?",
    "96. What is correcting errors in a program called ?",
    "97. BCD is __?",
    "98. What type of virus uses computer hosts to reproduce itself?",
    "99. SMTP, FTP and DNS are applications of the ____ layer?",
    "100. Which command is used to select the whole document?"
]
