[
    "1. Which bank is the Banker of the Banks?",
    "2. For international payments, to which currency is the Indian currency linked?",
    "3. Where is the headquarter of East African Development Bank?",
    "4. In which year Statutory Liquidity Ratio was first imposed on banks?",
    "5. The Unclaimed deposits are those deposits which haven’t been operated for how many years?",
    "6. CENVAT is associated with______?",
    "7. Gilt edged means______?",
    "8. What is the effect of Deficit financing?",
    "9. Who was the first Indian Governor of RBI?",
    "10. The principal sources of revenue to the State Government in India is______?",
    "11. Indias Economic Summit was held in December 1999, in________?",
    "12. When a person has a saving account in the bank, the bank assumes\nthe position of _________?",
    "13. Which is the largest Private Sector Bank in India?",
    "14. Which ministry formulates fiscal policy?",
    "15. In which year SIDBI was established?",
    "16. What is the highest denomination of currency notes in circulation as legal tender in India at present?",
    "17. How many banks were nationalized in 1969?",
    "18. In April 1980 how many banks were nationalized?",
    "19. When was decimal coinage introduced in India?",
    "20. One rupee notes contain the signature of_______?",
    "21. Which is treated as artificial currency?",
    "22. Companies pay corporation tax on their______?",
    "23. What was the earlier name of the WTO?",
    "24. If saving exceeds investment, what will be the effect on national income_______?",
    "25. Which is the oldest stock exchange in Asia?",
    "26. Temporary tax levied to obtain additional revenue is called_________?",
    "27. Which European country is the guarantor of Bank of Central African States?",
    "28. When was Consumer Protection Act(COPRA) passed?",
    "29. The Money Order system in India was introduced in the year________?",
    "30. Investment in public works is known as_______?",
    "31. Where are the headquarters of IMF and World Bank located?",
    "32. Who appoints Banking Ombudsman?",
    "33. In which year was Railway Budget in India separated from general budget?",
    "34. Which is the best measure of economic growth of a country?",
    "35. Economic growth is usually coupled with_____?",
    "36. Which is the oldest stock exchange in the world?",
    "37. Taxation and the government’s expenditure policy are dealt under which policy?",
    "38. If the price of an inferior good falls, what about its demand?",
    "39. Which type of unemployment mostly found in India?",
    "40. Which is the largest Public Sector Bank in India?",
    "41. What is the main source of revenue to meet different expenditures?",
    "42. Bouncing of cheques has become an offence. What is the punishment for the same?",
    "43. The main source of National Income in India is______?",
    "44. A crossed cheque is one, which can be encased only at which bank?",
    "45. The currency convertibility concept in its original form originated in?",
    "46. The difference between GNP & GDP is______?",
    "47. 'Brent ' Index is associated with ______?",
    "48. The Foreign Exchange Management Act(FEMA) was passed in which year?",
    "49. Which plan is also known as 'Gadgil Yojana'?",
    "50. Who presented the first union budget of Independent India?",
    "51. States earn maximum revenue through?",
    "52. Short-term finance is usually for a period ranging up to?",
    "53. When did India become a member of international Monetary Fund (IMF)?",
    "54. Who coined the term ‘Hindu rate of growth’ for Indian Economy?",
    "55. When was the National Bank for Agriculture and Rural Development (NABARD) set up?",
    "56. Where are the headquarters of United Nations Conference on Trade and Development (UNCTAD)?",
    "57. Who is called the ‘Father of Economics’?",
    "58. Which sector of Indian Economy has shown remarkable expansion during the last decade?",
    "59. Which state has the lowest per capita income?",
    "60. World Development Report is an annual publication of_________?",
    "61. The slogan of ‘Garibi Hatao’ (Remove Poverty) was launched in which FYP?",
    "62. ‘Golden Handshake Scheme’ is associated with______?",
    "63. Who has presented the Union Budget of India maximum number of times?",
    "64. Who is the chairman of 14th Finance Commission?",
    "65. The second Five Year plan was based on_____?",
    "66. The first devaluation of Indian currency took place in which year?",
    "67. VAT has been introduced on the recommendation of which commission?",
    "68. In which year was Minimum inflation in post economic reform?",
    "69. Who was the Chairman of the first Finance Commission?",
    "70. Those goods which have positive relationship between price and quantity demanded are called as ….?",
    "71. On July 12, 1982, the ARDC was merged into_______?",
    "72. Which Indian got Nobel Prize for Economics?",
    "73. National Income estimates in India is prepared by _______?",
    "74. Who wrote the book ‘Planned Economy for India’?",
    "75. Which is the oldest Development Financial Institution of India?",
    "76. When was EXIM Bank set-up?",
    "77. Which is the ‘Slack Season’ in the Indian Economy?",
    "78. To meet the need of whom, the concept of Land Development Bank has been developed?",
    "79. When was the Rolling plan designed?",
    "80. Which country is the largest debtor of UNO?",
    "81. Which was first Commercial Bank of India?",
    "82. Participatory Notes (PNs) are associated with which investors?",
    "83. A new private bank is established under which act?",
    "84. How many country are represented in International Monetary Fund (IMF)?",
    "85. In which plan was the objective of self-reliance and zero net foreign aid was declared?",
    "86. National Rural Development Institute is situated at_______?",
    "87. Name the oldest insurance company of India?",
    "88. On which date a Bank publishes its balance sheet?",
    "89. Excise duty is a tax levied on the_______?",
    "90. Which state stands first in the length of roads in the country?",
    "91. Deficit financing means that the government borrows money from the______?",
    "92. “Bad money (if not limited in quantity) drives good money out of circulation.” is the law known as______?",
    "93. The \"\"Garibi Hatao\"\" slogan was coined in______?",
    "94. When was the Reserve Bank of India taken over by the Government?",
    "95. Who is considered the guardian of the Public Purse?",
    "96. In which year Swarn Jayanti Gram Swarozgar Yojna came into being?",
    "97. The philosophy of 'Laissez-faire' is associated with?",
    "98. Where in Indian are coins minted?",
    "99. In India, in which year was the service tax first introduced?",
    "100. National Rural Employment Guarantee Scheme (NREGS) came into force in which year?"
]
