[
    "1. Who invited Babar to invade India?",
    "2. Who attended the Second Round Table Conference as the representative of the Congress?",
    "3. Who was the member of ‘Din-llahi\"?",
    "4. Who, was the Nanda ruler at the time of Alexander’ invasion?",
    "5. Who is known as the ‘indian Bismark’?",
    "6. Who named ‘Prayag Nagar’ as ‘Allahabad”?",
    "7. Who passed the Indian university Act?",
    "8. By whom was Saka era founded?",
    "9. Which Peshwas was popularly known as Nana-Saheb?",
    "10. Memories of Babur (Tuzk-eBabur) was written in which language?",
    "11. Who organised Ashwamedha Yajna in Gupta Period?",
    "12. Which group were related to ‘Tana Bhagat’ movernent?",
    "13. Who was thrice elected President of the Indian National Congress?",
    "14. Who, was the Nanda ruler at the time of Alexander’ invasion?",
    "15. Which Chola ruler converted the Bay of Bengal into a ‘Chela lake’?",
    "16. During which reign was Kalidasa lived?",
    "17. The Gayatri Mantra contained in the Rigveda is dedicated to which deity?",
    "18. Which ruler was known as Amitraghata, the ‘destroyer of foes\"?",
    "19. Under which suitan, Chalisa land increased considerably?",
    "20. Which Mughal emperor's tomb is outside India?",
    "21. Who was the first foreigner to invade India?",
    "22. Which was the God of animal during the later Vedic period?",
    "23. From where sufi movement was started?",
    "24. By whom was the famouis'Kirti Stambha’ at Chittor built?",
    "25. Analects is sacred text of which religion?",
    "26. Which Rajput dynasties did not surrender to Akbar?",
    "27. Which ruler at first assumed the title of ‘Hazrat-Ala' and afterwards ‘Sultan’?",
    "28. Who is related to Sarvodaya and Bhoodan movement?",
    "?",
    "30. Which was capital of Raja Ranjit Singh of Punjab?",
    "31. High Courts in Calcutta, Mumbai and Madras were established in which year?",
    "32. What was the script used in the earliest Tamil inscriptions?",
    "33. At which place did Mahatma Gandhi start his first Satyagraha in India?",
    "34. Who was the British PM at the time of Revolt of 1857?",
    "35. Who is considered to be the father of Ayurveda?",
    "36. Which Veda throws light on the beliefs and practices of the non-Aryans?",
    "37. Who was called Zinda Pir (living saint) in Mughal India?",
    "38. What was Sher Shah's real name?",
    "39. Who earned the title of a ‘Liberator?",
    "40. With whom did Alberuni come to India?",
    "41. Who was the President of the Indian National Congress, while the Mountbatten Plan was accepted?",
    "42. Who first voiced the idea of a separate Muslim state in India?",
    "43. Who founded ‘Bharat Sevak Samaj’ (Servants of Indian Society)?",
    "44. Who had the Revenue system during Akbar’ reign?",
    "45. Attack on ‘chittgaon arsenal’ was done in whose leadership?",
    "46. Who is associated with Tashkent Agreement?",
    "47. Who advocated the policy of abolishing princely states in free India?",
    "48. Who was responsible for the integration of Indian Princely States?",
    "49. In which year was the Muslim league founded?",
    "50. In which year did the Congress loose its monopoly of power in the States for the first time after the elections?",
    "51. Where there is no law, there is no freedom\" who said this?",
    "52. Who was the famous Indo-Greek king who embraced Buddhism?",
    "53. Who destroyed the group of Forty Nobles?",
    "54. Who was the daughter of Emperor Aurangzeb?",
    "55. Who was the first speaker of independent India?",
    "56. Where was first Madarasa set up by the British in India?",
    "57. In India, where did the Dutch establish their earliest factory?",
    "58. Who was the writer of ‘the Indian War of Independence”?",
    "59. In which battle did Nadir shah defeated Muhammad Shah?",
    "60. By whom was the first muslim invasion of India lead?",
    "61. What is the subject matter of the Upanishads?",
    "62. Who betrayed Sirajud-Daulah in the battle of Plassey in 1757?",
    "63. A Fortgotten Empire’, written by the renowned historian Robert Sewell, is about which empire?",
    "64. Who proposed the name Pakistan\"?",
    "65. Who was the oldest British monarch to sit on the throne?",
    "66. By whom was the first estimate of national income in India made?",
    "67. Where did ‘Parallel government’ form during Quit India movement?",
    "68. During whose Viceroyalty, Queen Victoria was crowned with Kaiser Hind’ in Delhi Durbar?",
    "69. Late Raja Ravi Verma, was an eminent figure in which field?",
    "70. Who stated that there was.no slavery in India?",
    "71. Who was the regent of Akbar?",
    "72. By whom was the agitation against the partition of Bengal led?",
    "73. Who was the Mughal Emperor to have lifted the Jaziya on Hindus?",
    "74. Who is known as ‘the father of India's unrest’?",
    "75. Which ruler had granted Diwani to the East India company?",
    "76. Against whom did Gandhiji started Satyagraha movement in 1919 in protest?",
    "77. Who was the first President of the Indian Trade Union Congress in 1920?",
    "78. ‘Man-The Maker of His Own Destiny’ book was written by which person?",
    "79. Whowas the first governor of Portuguese in India?",
    "80. During which movement was Mahatma’ added before Gandhij's name?",
    "81. Whois the Father of local self government in India?",
    "82. Who introduced Mansabdari system?",
    "83. By whom was the Indian Independence League set up?",
    "84. On whichriver did Pulakesin ll defeat Harshavardhana?",
    "85. By whom was the city of Agra founded in 1504?",
    "86. Who deciphered Adhikansh Inscriptions for the first time?",
    "87. By whom was the practice of Sati was declared illegal?",
    "88. Who was the Governor General when the first Anglo-Burmese was started?",
    "89. Who was the first Indian Hindi scholar of the Mughal period?",
    "90. Quit India Movement started after the failure of which proposal?",
    "91. Who wrote the song ‘Saare Jahan Se Acha’?",
    "92. When the East India Company came intoexistence,By whom was England was ruled?",
    "93. Inwhich session was PURNA SWARAJ! adopted as it’s goal by INC?",
    "94. Who first started the civil servicesin India?",
    "95. Attack on ‘chittgaon arsenat’ was done in whose leadership?",
    "96. Who is associated with Tashkent Agreement?",
    "97. In which year was the Muslim league founded?",
    "98. In which year did the Congress loose its monopoly of power in the States for thefirsttime afterthe elections?",
    "99. In which year Mahatma Gandhiwas first arrestedduring'Satyagrah’ -1908\n100. Who among the following s thefirst EnglishmantobecomethepresidentofINC?",
    "100. Who among the following s thefirst EnglishmantobecomethepresidentofINC?"
]
